projeto4/relatorio4.org
#+include:  ./header.org
#+startup: latexpreview
* Tarefa A
O objetivo dessa tarefa é implementar o método de Euler e o método de Euler-Cromer para
discretização do sistema do pêndulo simples. Primeiramente vamos analisar as equações diferenciais que descrevem
o sistema.

A força atuando no sistema pode ser escrita como \( m a_{\theta } = m l \frac{d^2 }{dt²} \theta  = -g m
\sin \theta   \) e podemos
aproximar o seno fazendo uma expansão de Taylor, temos então 
\[ \sin \theta = \sum_{n = 0}^{\infty} (-1)^n  \frac{\theta ^  {2n+1}}{(2n+1)!} = \theta - \frac{1}{3!}\theta ^3 +
\frac{1}{5!}\theta ^5 + \cdots  \]
para \( \theta  \to 0 \Rightarrow  \sin \theta  \approx \theta  \), segue que
#+begin_latex
\begin{equation}
\frac{d^2}{dt²} \theta  \approx - \frac{g}{l} \theta 
\label{eq:edo1}
\end{equation}
#+end_latex

a (\ref{eq:edo1}) é uma EDO linear e pode ser representada por um sistema de equação diferenciais
acopladas

#+begin_latex
\begin{equation}
\frac{d^2}{dt^2} \theta  = \begin{cases}
    \omega = \frac{d}{dt} \theta  \\
   \frac{d}{dt} \omega = - \frac{g}{l} \theta   
\end{cases}
\end{equation}
\label{eq:edo2}
#+end_latex

discretizando as (\ref{eq:edo2}) temos o método de Euler

#+begin_latex
\begin{equation}
\omega_{i + 1} = \omega_i  - \left( \frac{g}{l} \right) \theta _i \Delta t 
\label{eq:omegaEuler}
\end{equation}
\begin{equation}
\theta _{i + 1} = \theta _i + \omega_i \Delta t
\label{eq:thetaEuler}
\end{equation}
#+end_latex

o método de Euler-Cromer é uma variação do anterior, é representado pelas equações abaixo

#+begin_latex
\begin{equation}
\omega_{i + 1} = \omega_i - \left( \frac{g}{l} \right) \theta _i \Delta t
\label{eq:omegaEulerCromer}
\end{equation}
\begin{equation}
\theta _{i + 1} = \theta _i + \omega_i \Delta t
\label{eq:thetaEulerCromer}
\end{equation}
#+end_latex
#+latex: \clearpage
** Código em Fortran

#+caption: Declaração das variáveis utilizadas. 
#+begin_src fortran :exports code
      implicit real * 8 (a-h, o-z)

      parameter(n = 10000)
      parameter(tt = 100)
      parameter(pi = acos(-1.0d0))

!     Gravidade
      parameter(p = 9.8d0)
!     Comprimento
      parameter(s = 9.8d0)
!     p/s = 1.0d0

      dt = (tt * 1.0d0) / (n * 1.0d0)

      tt1 = (2 * pi) / 48d0
      omg1 = 0.0d0
      e1 = - p * cos(tt1)

      tt2 = tt1 
      omg2 = omg1
      e2 = e1

      open(10, file="data-oscilacoes.dat")
      open(11, file="data-energias.dat")


            implicit real * 8 (a-h, o-z)

            parameter(n = 1000)
            parameter(tt = 50)
            parameter(pi = acos(-1.0d0))

  !         Gravidade
            parameter(p = 9.8d0)
  !         Comprimento
            parameter(s = 9.8d0)
            dt = (tt * 1.0d0) / (n * 1.0d0)

            tt1 = (2 * pi) / 48d0
            omg1 = 0.0d0
            e1 = (1.0d0/2.0d0)*s**2

            tt2 = tt1 
            omg2 = omg1
            e2 = e1

            open(10, file="data-oscilacoes.dat")
            open(11, file="data-energias.dat")

#+end_src

#+name: eulerCromer
#+caption: Estrutura dos cálculos e impressão nos arquivos =saida-oscilacoes.dat= e =saida-energias.dat=
#+begin_src fortran :exports code
      do i = 1, n

         t = t + dt

!     Metodo de Euler
         tmp_omg1 = omg1 - tt1 * dt
         tmp_tt1 = tt1 + omg1 * dt

         omg1 = tmp_omg1
         tt1 = tmp_tt1

!     Metodo de Euler-Cromer
         tmp_omg2 = omg2 - tt2 * dt
         tmp_tt2 = tt2 + tmp_omg2 * dt
         
         omg2 = tmp_omg2
         tt2 = tmp_tt2

!     Energia do sistema
         e1 = (1.0d0/2.0d0) * s **2 * omg1**2 + p * s * cos(tt1)
         e2 = (1.0d0/2.0d0) * s **2 * omg2**2 + p * s * cos(tt2)

         write(10, *) t, omg1, tmp_tt1, omg2, tmp_tt2
         write(11, *) t, e1, e2

      end do
      close(10)
      close(11)
      end
#+end_src
#+latex:\clearpage
