projeto4/relatorio4.org
** Resultados
  Apesar do sistema ser oscilatório e sem presença forças dissipativas, o método de Euler apresenta um
  comportamento contrário ao esperado. A amplitude das oscilações aumenta com o tempo. O método pode
  não apresentar esse comportamento se a escala de tempo utilizada for muito curta, mas para periodo
  maiores de tempo fica aparente.

  #+name: grafico-oscilacoes
  #+caption: Valores de $\theta$ pelo tempo \( t \) usando
  #+caption: método de Euler e o método de Euler-Cromer.
  #+attr_latex: :width 10cm :height 8cm :placement [!ht]
  #+attr_latex: :float wrap :width 0.6\textwidth :placement {r}{{0.5}\textwidth}
  [[./tarefa-a/tarefa-a-grafico-oscilacoes.pdf]]

  Para entender essa instabilidade do método podemos ánalisar o comportamento da energia mecânica do
  sistema. 
  \[ E = \Delta K + \Delta U \]
  \[ E = \frac{1}{2} m v^2  + mg \Delta h \]

  #+begin_latex
  \begin{equation}
   E = \frac{1}{2} m\omega^2 l^2  + mgl \cos \theta   
  \label{eq:energiaSistema}
  \end{equation}
  #+end_latex

  Note que essa equação cresce pra qualquer valor de \( \theta  \) conforme \( t \) aumenta,
  essa é a fonte da instabilidade do método de Euler. Ao contrário do método de
  Euler-Cromer, que consegue conservar energia sob periodos inteiros de oscilação, ele
  aumenta a energia do mais rapidamente e uma consequência disso é o aumento da amplitude
  da oscilação a cada iteração, como está claro no gráfico ([[grafico-oscilacoes]]).

  #+latex: \vskip 1cm 

  Pelo gráfico das energias calculadas pelos métodos podemos ver que o método de Euler-Cromer
  mantém uma energia constante, como esperado para um sistema conservativo e o método de Euler não.
  

  #+name: grafico-energias
  #+caption: Energia do sistema calculada pelo método de Euler e Euler-Cromer.
  #+attr_latex: :width 10cm :height 8cm :placement [!h]
  [[./tarefa-a/tarefa-a-grafico-energias.pdf]]

    Por fim, o método de Euler não é um método bom para problemas desse tipo, onde queremos analisar
    o comportamento oscilatórios. Para problemas que envolvem oscilações os método de Euler-Cromer
    apresenta maior estabilidade.
    
    

    


  #+latex: \clearpage
* Tarefa B
** B1
  Para as condições dadas temos a seguinte relação
  #+begin_latex
   \begin{equation}
   \frac{d}{dt} \omega = - \frac{g}{l} \sin \theta 
   \label{eq:penduloSimples}
   \end{equation}
  #+end_latex
  usaremos o método de Euler-Cromer para avaliar o período do movimento do pêndulo simples em função
  de um \( \theta _0 \), sabemos que o sistema (\ref{eq:penduloSimples}) é um pêndulo simples e então
  o esperado é que tenha um período equivalente a
  \[ T = 2 \pi \sqrt{ \frac{l}{g}} \]

  no programa implementado em fortran foi feita uma modificação em relação ao código ([[eulerCromer]]),
  nesse algoritmo foi utilizada a noção de busca direta para realizar uma contagem de raízes da função
  cálculada, ou seja, foi contado o número de vezes que o gráfico do movimento corta o eixo horizontal
  e por fim feito uma média que nos dá o período de oscilação. No código abaixo temos a implementação
  desse método


  #+caption: Método de Euler-Cromer para o cálculo de período de oscilação do pêndulo simples.
  #+begin_src fortran
      count = 0
      do i = 1, n

         t = t + dt

         tmp_omg = omg - sin(tt) * dt
         tmp_tt = tt + tmp_omg * dt

         if(tmp_tt * tt < 0) then
            count = count + 1
         end if

         omg = tmp_omg
         tt = tmp_tt
      end do

      T = (2 * t) / count
#+end_src

  O objetivo desse problema é cálcular o período de um pêndulo físico usando duas fórmulas, a primera
  é a (\ref{eq:penduloSimples}) , implementada no código acima, e a segunda usando a integral eliptíca (\ref{eq:integralEliptica}),
  para isso, é necessário fazer a discretização dessa função.

*** Discretização da integral eliptíca

  \[ T(\theta_0) = \sqrt{ \frac{2l}{g}} \int_{- \theta _0}^{\theta _0} \frac{d \theta }{\sqrt{\cos \theta - \cos \theta _0  }}  \]

Para evitar problemas que podem ocorrer quando o denominador ficar muito próximo de zero adicionamos
uma constante \( \epsilon \) aos limites de integração, temos então

#+begin_latex
\begin{equation}
T(\theta _0) = \sqrt{ \frac{2l}{g}} \int_{- \theta _0 + \epsilon} ^{\theta _0 + \epsilon} \frac{d
\theta }{\sqrt{\cos \theta - \cos \theta _0 } }
\label{eq:integralElipticaDiscretizada}
\end{equation}
#+end_latex

podemos separar a integral em 3, e com isso encontramos podemos reduzir o cálculo dela à uma função
analítica

\[ T( \theta _0) = \underbrace{\sqrt{ \frac{2l}{g}} \int_{- \theta _0 + \epsilon} ^{ \theta _0 + \epsilon} \frac{d \theta
}{\sqrt{\cos \theta - \cos \theta _0}}}_{\text{Numérica}} + \underbrace{ \sqrt{ \frac{2l}{g}}
\int_{- \theta_0}^{- \theta _0 + \epsilon}\frac{d \theta }{\sqrt{\cos \theta - \cos \theta _0}} + \sqrt{ \frac{2l}{g}} \int_{\theta _0 - \epsilon}^{\theta _0} \frac{d
\theta }{\sqrt{\cos \theta - \cos \theta _0  }}}_{\text{Analiticas}} \]
Nesses limites de integração temos que

\[ \sqrt{ \frac{2l}{g}} \int_{ - \theta _0 }^{-\theta _0 + \epsilon} \frac{d \theta }{\sqrt{\cos
  \theta - \cos \theta _0}} =
  \sqrt{ \frac{2l}{g}} \int_{\theta _0 - \epsilon}^{\theta _0} \frac{d
\theta }{\sqrt{\cos \theta - \cos \theta _0  }} \]

podemos então considerar apenas uma das duas integrais, fazendo

\[ A = 2 \sqrt { \frac{2l}{g}} \int_{- \theta_0}^ { -\theta _0 + \epsilon } \frac{d \theta }{\sqrt{\cos \theta - \cos \theta _0} } \]

Resolvendo a integral temos que, \( \theta \to \theta _0 \) , com \( \theta = - \theta _0 + \varphi
\) e \( \varphi \to 0 \), então
\[ \cos \theta - \cos \theta _0 = cos( - \theta _0 + \varphi) - \cos \theta = \cos \theta_0
\cos\varphi + \sin \theta_0 \sin \varphi - \cos \theta_0      \]
\[ \cos \theta - \cos \theta _0 = \varphi  \sin \theta _0   \]

com essa relação podemos avaliar a integral no intervalo de integração \( [ 0, \epsilon] \), fazendo
a mudança de variáveis temos

\[  \int_{- \theta _0 }^{\theta _0 + \epsilon} \frac{ d \theta }{\sqrt{\cos \theta - \cos \theta _0}
} = \int_{0}^{\epsilon} \frac{1}{\sqrt{\sin \varphi}} \frac{1}{\varphi} d\varphi\]

\[ A = 2 \sqrt{\frac{2l}{g}} \sqrt{\frac{\epsilon}{\sin  \theta _0}} \]

A função do período em \( \theta _0 \) é dada por 
#+begin_latex
\begin{equation}
T( \theta _0) = \sqrt{\frac{2l}{g}} \int_{- \theta _0}^{\theta _0 + \epsilon} \frac{d \theta}{\sqrt{\cos \theta - \cos \theta _0  }}
+ 2 \sqrt{\frac{2l}{g}} \sqrt{\frac{\epsilon}{\sin  \theta _0}} 
\label{eq:formulaFinalPeriodo}
\end{equation}
#+end_latex

