projeto4/relatorio4.html
<div id="outline-container-org9316613" class="outline-3">
<h3 id="org9316613">Resultados</h3>
<div class="outline-text-3" id="text-org9316613">
<p>
Apesar do sistema ser oscilatório e sem presença forças dissipativas, o método de Euler apresenta um
comportamento contrário ao esperado. A amplitude das oscilações aumenta com o tempo. O método pode
não apresentar esse comportamento se a escala de tempo utilizada for muito curta, mas para periodo
maiores de tempo fica aparente.
</p>

<p>
<a href="./tarefa-a/tarefa-a-grafico-oscilacoes.pdf">./tarefa-a/tarefa-a-grafico-oscilacoes.pdf</a>
</p>

<p>
Para entender essa instabilidade do método podemos ánalisar o comportamento da energia mecânica do
sistema. 
\[ E = \Delta K + \Delta U \]
\[ E = \frac{1}{2} m v^2  + mg \Delta h \]
</p>

<div class="latex" id="orgc8b5081">
\begin{equation}
 E = \frac{1}{2} m\omega^2 l^2  + mgl \cos \theta   
\label{eq:energiaSistema}
\end{equation}

</div>

<p>
Note que essa equação cresce pra qualquer valor de \( \theta  \) conforme \( t \) aumenta,
essa é a fonte da instabilidade do método de Euler. Ao contrário do método de
Euler-Cromer, que consegue conservar energia sob periodos inteiros de oscilação, ele
aumenta a energia do mais rapidamente e uma consequência disso é o aumento da amplitude
da oscilação a cada iteração, como está claro no gráfico (<a href="#org0823119">1</a>).
</p>

<p>
Pelo gráfico das energias calculadas pelos métodos podemos ver que o método de Euler-Cromer
mantém uma energia constante, como esperado para um sistema conservativo e o método de Euler não.
</p>


<p>
<a href="./tarefa-a/tarefa-a-grafico-energias.pdf">./tarefa-a/tarefa-a-grafico-energias.pdf</a>
</p>

<p>
Por fim, o método de Euler não é um método bom para problemas desse tipo, onde queremos analisar
o comportamento oscilatórios. Para problemas que envolvem oscilações os método de Euler-Cromer
apresenta maior estabilidade.
</p>
</div>
</div>
</div>
<div id="outline-container-orgfd4607d" class="outline-2">
<h2 id="orgfd4607d"><span class="section-number-2">2.</span> Tarefa B</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd545644" class="outline-3">
<h3 id="orgd545644">B1</h3>
<div class="outline-text-3" id="text-orgd545644">
<p>
Para as condições dadas temos a seguinte relação
</p>
<div class="latex" id="org570807b">
\begin{equation}
\frac{d}{dt} \omega = - \frac{g}{l} \sin \theta 
\label{eq:penduloSimples}
\end{equation}

</div>
<p>
usaremos o método de Euler-Cromer para avaliar o período do movimento do pêndulo simples em função
de um \( \theta _0 \), sabemos que o sistema (\ref{eq:penduloSimples}) é um pêndulo simples e então
o esperado é que tenha um período equivalente a
\[ T = 2 \pi \sqrt{ \frac{l}{g}} \]
</p>

<p>
no programa implementado em fortran foi feita uma modificação em relação ao código (<a href="#orgd2ffb8b">2</a>),
nesse algoritmo foi utilizada a noção de busca direta para realizar uma contagem de raízes da função
cálculada, ou seja, foi contado o número de vezes que o gráfico do movimento corta o eixo horizontal
e por fim feito uma média que nos dá o período de oscilação. No código abaixo temos a implementação
desse método
</p>


<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>Método de Euler-Cromer para o cálculo de período de oscilação do pêndulo simples.</label><pre class="src src-fortran"><span style="color: #2aa1ae; background-color: #ecf3ec;">c</span><span style="color: #2aa1ae; background-color: #ecf3ec;">ount = 0</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">d</span><span style="color: #2aa1ae; background-color: #ecf3ec;">o i = 1, n</span>

   t = t + dt

   tmp_omg = omg - <span style="color: #3a81c3;">sin</span><span style="color: #3a81c3;">(</span>tt<span style="color: #3a81c3;">)</span> * dt
   tmp_tt = tt + tmp_omg * dt

   <span style="color: #3a81c3; font-weight: bold;">if</span><span style="color: #3a81c3;">(</span>tmp_tt * tt &lt; 0<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3; font-weight: bold;">then</span>
      count = count + 1
   <span style="color: #3a81c3; font-weight: bold;">end</span> <span style="color: #3a81c3; font-weight: bold;">if</span>

   omg = tmp_omg
   tt = tmp_tt
<span style="color: #3a81c3; font-weight: bold;">end</span> <span style="color: #3a81c3; font-weight: bold;">do</span>

T = <span style="color: #3a81c3;">(</span>2 * t<span style="color: #3a81c3;">)</span> / count
</pre>
</div>

<p>
O objetivo desse problema é cálcular o período de um pêndulo físico usando duas fórmulas, a primera
é a (\ref{eq:penduloSimples}) , implementada no código acima, e a segunda usando a integral eliptíca (\ref{eq:integralEliptica}),
para isso, é necessário fazer a discretização dessa função.
</p>
</div>

<div id="outline-container-org9ba09c5" class="outline-4">
<h4 id="org9ba09c5">Discretização da integral eliptíca</h4>
<div class="outline-text-4" id="text-org9ba09c5">
<p>
\[ T(\theta_0) = \sqrt{ \frac{2l}{g}} \int_{- \theta _0}^{\theta _0} \frac{d \theta }{\sqrt{\cos \theta - \cos \theta _0  }}  \]
</p>

<p>
Para evitar problemas que podem ocorrer quando o denominador ficar muito próximo de zero adicionamos
uma constante \( \epsilon \) aos limites de integração, temos então
</p>

<div class="latex" id="org9bcfdb5">
\begin{equation}
T(\theta _0) = \sqrt{ \frac{2l}{g}} \int_{- \theta _0 + \epsilon} ^{\theta _0 + \epsilon} \frac{d
\theta }{\sqrt{\cos \theta - \cos \theta _0 } }
\label{eq:integralElipticaDiscretizada}
\end{equation}

</div>

<p>
podemos separar a integral em 3, e com isso encontramos podemos reduzir o cálculo dela à uma função
analítica
</p>

<p>
\[ T( \theta _0) = \underbrace{\sqrt{ \frac{2l}{g}} \int_{- \theta _0 + \epsilon} ^{ \theta _0 + \epsilon} \frac{d \theta
}{\sqrt{\cos \theta - \cos \theta _0}}}_{\text{Numérica}} + \underbrace{ \sqrt{ \frac{2l}{g}}
\int_{- \theta_0}^{- \theta _0 + \epsilon}\frac{d \theta }{\sqrt{\cos \theta - \cos \theta _0}} + \sqrt{ \frac{2l}{g}} \int_{\theta _0 - \epsilon}^{\theta _0} \frac{d
\theta }{\sqrt{\cos \theta - \cos \theta _0  }}}_{\text{Analiticas}} \]
Nesses limites de integração temos que
</p>

<p>
\[ \sqrt{ \frac{2l}{g}} \int_{ - \theta _0 }^{-\theta _0 + \epsilon} \frac{d \theta }{\sqrt{\cos
  \theta - \cos \theta _0}} =
  \sqrt{ \frac{2l}{g}} \int_{\theta _0 - \epsilon}^{\theta _0} \frac{d
\theta }{\sqrt{\cos \theta - \cos \theta _0  }} \]
</p>

<p>
podemos então considerar apenas uma das duas integrais, fazendo
</p>

<p>
\[ A = 2 \sqrt { \frac{2l}{g}} \int_{- \theta_0}^ { -\theta _0 + \epsilon } \frac{d \theta }{\sqrt{\cos \theta - \cos \theta _0} } \]
</p>

<p>
Resolvendo a integral temos que, \( \theta \to \theta _0 \) , com \( \theta = - \theta _0 + \varphi
\) e \( \varphi \to 0 \), então
\[ \cos \theta - \cos \theta _0 = cos( - \theta _0 + \varphi) - \cos \theta = \cos \theta_0
\cos\varphi + \sin \theta_0 \sin \varphi - \cos \theta_0      \]
\[ \cos \theta - \cos \theta _0 = \varphi  \sin \theta _0   \]
</p>

<p>
com essa relação podemos avaliar a integral no intervalo de integração \( [ 0, \epsilon] \), fazendo
a mudança de variáveis temos
</p>

<p>
\[  \int_{- \theta _0 }^{\theta _0 + \epsilon} \frac{ d \theta }{\sqrt{\cos \theta - \cos \theta _0}
} = \int_{0}^{\epsilon} \frac{1}{\sqrt{\sin \varphi}} \frac{1}{\varphi} d\varphi\]
</p>

<p>
\[ A = 2 \sqrt{\frac{2l}{g}} \sqrt{\frac{\epsilon}{\sin  \theta _0}} \]
</p>

<p>
A função do período em \( \theta _0 \) é dada por 
</p>
<div class="latex" id="orgb8c0319">
\begin{equation}
T( \theta _0) = \sqrt{\frac{2l}{g}} \int_{- \theta _0}^{\theta _0 + \epsilon} \frac{d \theta}{\sqrt{\cos \theta - \cos \theta _0  }}
+ 2 \sqrt{\frac{2l}{g}} \sqrt{\frac{\epsilon}{\sin  \theta _0}} 
\label{eq:formulaFinalPeriodo}
\end{equation}

</div>
</div>
</div>
