projeto4/relatorio4.org
*** Método de Boole

    Com o ferramental adquirido no projeto anterior podemos utilizar um método de integração (nesse
    caso o método de Boole foi o escolhido) para avaliar a integral eliptíca
    (\ref{eq:integralEliptica}), este é dado pela seguinte relação

    #+begin_latex
    \begin{equation}
      \int_{a}^{b} f(x) dx = \frac{2h}{45}  \left( 7 f(x) + 32 f(x + h) + 12 f(x + 2h) + 32f(x + 3h) + f(x+4h) \right) ,
      h =  \frac{b - a}{N}
    \label{eq:metodoBoole}
    \end{equation}
    #+end_latex
    onde \( N \) é o número de iterações utilizadas para o cálculo da integral.
  
  
    Ajustando a discretização da (\ref{eq:integralElipticaDiscretizada}) para usar o método de boole
    temos que \( h = \frac{b - a}{N} \), onde \( [a,b] \)  é o intervalo de integração \( [a,b] =
  [\theta _0  + \epsilon, - \theta _0 + \epsilon] \), segue que
    \( h = \frac{2 \theta _0}{N} \). Sabemos pelo projeto anterior sobre *Cálculo Numérico* que o método
    de Boole pode apresentar melhor precisação para \( h \) na ordem de \( 10^{-5} \), portanto essa
    será a ordem usada nessa implementação. 
*** Código da implementação do método de Boole
  #+name: metodoBoole
  #+caption: Calculo da integral usando método de Boole
  #+begin_src fortran -n 18 :exports code
!        Metodo de Boole
         h = (2 * tt0)/n
         do i = 0, (n/4) - 1
            
            tt = - tt0 + 2*i*h + e
            
            f0 = f(tt, tt0) 
            f1 = f(tt + h, tt0)
            f2 = f(tt + 2*h, tt0)
            f3 = f(tt + 3*h, tt0) 
            f4 = f(tt + 4*h, tt0)
            
            sum = sum + (7*f0+32*f1+12*f2+32*f3+7*f4)
         end do

         sum = sum*(2*h/45)
         sum = sqrt(2d0) * sum + 2 * sqrt(2d0) * sqrt(e/sin(tt0))
  #+end_src
  #+caption: Função da integral.
  #+begin_src fortran -n 35 :exports code
      function f(tt, tt0)
      implicit real * 8 (a-h, o-z)
      pi = acos(-1.d0)
      f = 1.0d0 / sqrt(cos(tt) - cos(tt0))  
      return
      end
  #+end_src
  #+latex:\clearpage
** Resultados B1 e B2
  Os métodos implementados fornecem as seguintes aproximações para alguns ângulos iniciais:
  #+begin_latex
\begin{table}[htb!]
\centering
\caption{Cálculo do período de oscilação para um ângulo \( \theta _0 \) inicial utilizando aproximações numéricas. }
\begin{tabular}{|c|c|c|}
\hline
$\theta_0$  & \begin{tabular}[c]{@{}c@{}}Aproximação pelo método\\ Euler-Cromer\end{tabular} & Integral Eliptica  \\ \hline
$ 7 \pi/18$ & 6.9444444444455478                                                             & 6.9470463343391113 \\ \hline
$ \pi/3$    & 6.7567567567578299                                                             & 6.7566483723506163 \\ \hline
$ \pi/2$    & 7.4074074074085843                                                             & 7.4566305768269627 \\ \hline
$5\pi/6$    & 11.111111111112876                                                             & 11.217766346528297 \\ \hline
\end{tabular}
\end{table}
  #+end_latex

  Para valores iniciais de \( \theta _0 \leq  \pi / 6  \), nota-se que o ângulo inicial é irrelevante na
  determinação do período, foram feitas aproximações afim de demonstrar que para \( \theta _0 \)
  pequenos o período é dado por
  #+begin_latex
  \begin{equation}
   T \approx 2 \pi \sqrt{\frac{l}{g}}   \left( 1 + \frac{\theta _0^2}{16} \right)
   \label{eq:aproxPeriodo}
  \end{equation}
  #+end_latex
  
  #+begin_latex
\begin{table}[htb!]
\centering
\begin{tabular}{|c|c|c|c|}
\hline
$\theta_0$ & \begin{tabular}[c]{@{}c@{}}Aproximação pelo método \\ de Euler-Cromer\end{tabular} & Integral Eliptíca  & Forma analítica    \\ \hline
$\pi / 12$ & 6.3291139240516383                                                                 & 6.3149738926809489 & 6.3101004779090131 \\ \hline
$\pi/24$   & 6.2893081761016276                                                                 & 6.2715816787230629 & 6.2899140998619432 \\ \hline
$\pi/48$   & 6.2893081761016276                                                                 & 6.2508046777271904 & 6.2848675053501752 \\ \hline
$\pi/96$   & 6.2893081761016276                                                                 & 6.2390644294801740 & 6.2836058567222342 \\ \hline
\end{tabular}
\end{table}
  #+end_latex

  Como esperado o comportamento do período para ângulos iniciais pequenos pode ser aproximado pela
  (\ref{eq:aproxPeriodo}) e nas simulações feitas obtive até a aproximação para um erro de até \(
  10^{-2}\).

** *B3*
  #+name: b3
  Sabemos que a fórmula geral da oscilação de um do pêndulo simples é dada por

  #+begin_latex
  \begin{equation}
   \frac{d \omega}{dt} = - \frac{g}{l} \sin \theta  - \gamma \frac{d \theta }{dt}  + F_o \sin (\Omega t)
   \label{eq:formulaGeralPendulo}
  \end{equation}
  #+end_latex

  até agora foram realizadas simulações considerando o sistema não dissipativo,
  nessa tarefa foi implementado o cálculo para o caso com  \( \gamma = 1/2 \) para analizar o
  comportamento do sistema com forças dissipativas atuando nele.

  O \( \gamma  \) é chamado fator de amortecimento e determina o quão abrupta será a diminuição do
  movimento, é esperado que um sistema desse tipo, com \( \gamma = \frac{1}{2} \) apresente amortecimento
  sub-critíco.

  #+latex:\clearpage
