projeto4/relatorio4.html

<div id="outline-container-org143d6c2" class="outline-4">
<h4 id="org143d6c2">Método de Boole</h4>
<div class="outline-text-4" id="text-org143d6c2">
<p>
Com o ferramental adquirido no projeto anterior podemos utilizar um método de integração (nesse
caso o método de Boole foi o escolhido) para avaliar a integral eliptíca
(\ref{eq:integralEliptica}), este é dado pela seguinte relação
</p>

<div class="latex" id="orge765ef1">
\begin{equation}
  \int_{a}^{b} f(x) dx = \frac{2h}{45}  \left( 7 f(x) + 32 f(x + h) + 12 f(x + 2h) + 32f(x + 3h) + f(x+4h) \right) ,
  h =  \frac{b - a}{N}
\label{eq:metodoBoole}
\end{equation}

</div>
<p>
onde \( N \) é o número de iterações utilizadas para o cálculo da integral.
</p>


<p>
Ajustando a discretização da (\ref{eq:integralElipticaDiscretizada}) para usar o método de boole
temos que \( h = \frac{b - a}{N} \), onde \( [a,b] \)  é o intervalo de integração \( [a,b] =
  [\theta _0  + \epsilon, - \theta _0 + \epsilon] \), segue que
\( h = \frac{2 \theta _0}{N} \). Sabemos pelo projeto anterior sobre <b>Cálculo Numérico</b> que o método
de Boole pode apresentar melhor precisação para \( h \) na ordem de \( 10^{-5} \), portanto essa
será a ordem usada nessa implementação. 
</p>
</div>
</div>
<div id="outline-container-org52a97b5" class="outline-4">
<h4 id="org52a97b5">Código da implementação do método de Boole</h4>
<div class="outline-text-4" id="text-org52a97b5">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>Calculo da integral usando método de Boole</label><pre class="src src-fortran" id="orga92641b"><span class="linenr">18: </span><span style="color: #2aa1ae; background-color: #ecf3ec;">!        </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Metodo de Boole</span>
<span class="linenr">19: </span>         h = <span style="color: #3a81c3;">(</span>2 * tt0<span style="color: #3a81c3;">)</span>/n
<span class="linenr">20: </span>         <span style="color: #3a81c3; font-weight: bold;">do</span> i = 0, <span style="color: #3a81c3;">(</span>n/4<span style="color: #3a81c3;">)</span> - 1
<span class="linenr">21: </span>
<span class="linenr">22: </span>            tt = - tt0 + 2*i*h + e
<span class="linenr">23: </span>
<span class="linenr">24: </span>            f0 = f<span style="color: #3a81c3;">(</span>tt, tt0<span style="color: #3a81c3;">)</span> 
<span class="linenr">25: </span>            f1 = f<span style="color: #3a81c3;">(</span>tt + h, tt0<span style="color: #3a81c3;">)</span>
<span class="linenr">26: </span>            f2 = f<span style="color: #3a81c3;">(</span>tt + 2*h, tt0<span style="color: #3a81c3;">)</span>
<span class="linenr">27: </span>            f3 = f<span style="color: #3a81c3;">(</span>tt + 3*h, tt0<span style="color: #3a81c3;">)</span> 
<span class="linenr">28: </span>            f4 = f<span style="color: #3a81c3;">(</span>tt + 4*h, tt0<span style="color: #3a81c3;">)</span>
<span class="linenr">29: </span>
<span class="linenr">30: </span>            sum = sum + <span style="color: #3a81c3;">(</span>7*f0+32*f1+12*f2+32*f3+7*f4<span style="color: #3a81c3;">)</span>
<span class="linenr">31: </span>         <span style="color: #3a81c3; font-weight: bold;">end</span> <span style="color: #3a81c3; font-weight: bold;">do</span>
<span class="linenr">32: </span>
<span class="linenr">33: </span>         sum = sum*<span style="color: #3a81c3;">(</span>2*h/45<span style="color: #3a81c3;">)</span>
<span class="linenr">34: </span>         sum = <span style="color: #3a81c3;">sqrt</span><span style="color: #3a81c3;">(</span>2d0<span style="color: #3a81c3;">)</span> * sum + 2 * <span style="color: #3a81c3;">sqrt</span><span style="color: #3a81c3;">(</span>2d0<span style="color: #3a81c3;">)</span> * <span style="color: #3a81c3;">sqrt</span><span style="color: #3a81c3;">(</span>e/<span style="color: #3a81c3;">sin</span><span style="color: #6c3163;">(</span>tt0<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>Função da integral.</label><pre class="src src-fortran"><span class="linenr">35: </span><span style="color: #3a81c3; font-weight: bold;">function</span> <span style="color: #6c3163; font-weight: bold;">f</span><span style="color: #3a81c3;">(</span>tt, tt0<span style="color: #3a81c3;">)</span>
<span class="linenr">36: </span><span style="color: #ba2f59; font-weight: bold;">implicit real</span> * 8 <span style="color: #3a81c3;">(</span>a-h, o-z<span style="color: #3a81c3;">)</span>
<span class="linenr">37: </span>pi = <span style="color: #3a81c3;">acos</span><span style="color: #3a81c3;">(</span>-1.d0<span style="color: #3a81c3;">)</span>
<span class="linenr">38: </span>f = 1.0d0 / <span style="color: #3a81c3;">sqrt</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">cos</span><span style="color: #6c3163;">(</span>tt<span style="color: #6c3163;">)</span> - <span style="color: #3a81c3;">cos</span><span style="color: #6c3163;">(</span>tt0<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>  
<span class="linenr">39: </span><span style="color: #3a81c3; font-weight: bold;">return</span>
<span class="linenr">40: </span><span style="color: #3a81c3; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0316dd9" class="outline-3">
<h3 id="org0316dd9">Resultados B1 e B2</h3>
<div class="outline-text-3" id="text-org0316dd9">
<p>
Os métodos implementados fornecem as seguintes aproximações para alguns ângulos iniciais:
</p>
<div class="latex" id="org654bc88">
\begin{table}[htb!]
\centering
\caption{Cálculo do período de oscilação para um ângulo \( \theta _0 \) inicial utilizando aproximações numéricas. }
\begin{tabular}{|c|c|c|}
\hline
$\theta_0$  & \begin{tabular}[c]{@{}c@{}}Aproximação pelo método\\ Euler-Cromer\end{tabular} & Integral Eliptica  \\ \hline
$ 7 \pi/18$ & 6.9444444444455478                                                             & 6.9470463343391113 \\ \hline
$ \pi/3$    & 6.7567567567578299                                                             & 6.7566483723506163 \\ \hline
$ \pi/2$    & 7.4074074074085843                                                             & 7.4566305768269627 \\ \hline
$5\pi/6$    & 11.111111111112876                                                             & 11.217766346528297 \\ \hline
\end{tabular}
\end{table}

</div>

<p>
Para valores iniciais de \( \theta _0 \leq  \pi / 6  \), nota-se que o ângulo inicial é irrelevante na
determinação do período, foram feitas aproximações afim de demonstrar que para \( \theta _0 \)
pequenos o período é dado por
</p>
<div class="latex" id="orgedcd48d">
\begin{equation}
 T \approx 2 \pi \sqrt{\frac{l}{g}}   \left( 1 + \frac{\theta _0^2}{16} \right)
 \label{eq:aproxPeriodo}
\end{equation}

</div>

<div class="latex" id="orgb22bcb2">
\begin{table}[htb!]
\centering
\begin{tabular}{|c|c|c|c|}
\hline
$\theta_0$ & \begin{tabular}[c]{@{}c@{}}Aproximação pelo método \\ de Euler-Cromer\end{tabular} & Integral Eliptíca  & Forma analítica    \\ \hline
$\pi / 12$ & 6.3291139240516383                                                                 & 6.3149738926809489 & 6.3101004779090131 \\ \hline
$\pi/24$   & 6.2893081761016276                                                                 & 6.2715816787230629 & 6.2899140998619432 \\ \hline
$\pi/48$   & 6.2893081761016276                                                                 & 6.2508046777271904 & 6.2848675053501752 \\ \hline
$\pi/96$   & 6.2893081761016276                                                                 & 6.2390644294801740 & 6.2836058567222342 \\ \hline
\end{tabular}
\end{table}

</div>

<p>
Como esperado o comportamento do período para ângulos iniciais pequenos pode ser aproximado pela
(\ref{eq:aproxPeriodo}) e nas simulações feitas obtive até a aproximação para um erro de até \(
  10^{-2}\).
</p>
</div>
</div>

<div id="outline-container-org3460b5f" class="outline-3">
<h3 id="org3460b5f"><b>B3</b></h3>
<div class="outline-text-3" id="text-org3460b5f">
<p>
Sabemos que a fórmula geral da oscilação de um do pêndulo simples é dada por
</p>

<div class="latex" id="org24feeb1">
\begin{equation}
 \frac{d \omega}{dt} = - \frac{g}{l} \sin \theta  - \gamma \frac{d \theta }{dt}  + F_o \sin (\Omega t)
 \label{eq:formulaGeralPendulo}
\end{equation}

</div>

<p>
até agora foram realizadas simulações considerando o sistema não dissipativo,
nessa tarefa foi implementado o cálculo para o caso com  \( \gamma = 1/2 \) para analizar o
comportamento do sistema com forças dissipativas atuando nele.
</p>

<p>
O \( \gamma  \) é chamado fator de amortecimento e determina o quão abrupta será a diminuição do
movimento, é esperado que um sistema desse tipo, com \( \gamma = \frac{1}{2} \) apresente amortecimento
sub-critíco.
</p>
</div>
