projeto4/relatorio4.org
*** Código em Fortran
  O código para realizar essa simulação é apenas uma alteração do método de Euler-Cromer
  com adição dos novos valores utilizados.
  #+name: codigoGamma
  #+caption: Rotina que realiza o cálculo com \( \gamma = \frac{1}{2} \) 
  #+begin_src fortran :exports code
      tt = 7 * pi / 18 
       do i = 1, n

       t = t + dt

       tmp_omg = omg - sin(tt) * dt - gamma*omg*dt
       tmp_tt = tt + tmp_omg * dt

       omg = tmp_omg
       tt = tmp_tt
       write(10, *) t, tmp_tt
    end do
  #+end_src

  A partir dos resultados desse programa foi gerado o gráfico ([[graficoB3]]) , que constata o que
  esperavamos, que o comportamento das oscilações para o \( \gamma  \) escolhido é subcritíco. 

  #+name: graficoB3
  #+caption: Gráfico de \( \theta \times t\) com \( \gamma  = \frac{1}{2} \) 
  #+attr_latex: :width 10cm :height 8cm :placement [!h]
  [[./tarefa-b/b3/tarefa-b3-grafico-oscilacoes.pdf]]
  #+latex:\clearpage
** *B4*
  
  Dando continuidade à tarefa anterior, nesse tópico foi o objetivo é fazer simulações
  para o sistema com dissipações e com oscilações forçadas por forças de intensidades diferentes.
  Para o sistema no caso onde \( \gamma  = \frac{1}{2} \), \( \Omega = \frac{3}{2} \) com \(
\Delta t = 0.03 \) para \( F_0 = 0, F_0 = \frac{1}{2} \text{ e } F_0 = \frac{6}{5} \) foi usada a
  equação (\ref{eq:formulaGeralPendulo}) para criar os gráficos conjuntos de para o \( \theta  \) e \( \omega \) em função do tempo.
  
  
  #+caption: Código do cálculo dos \( \theta  \) , \( \omega \) e períodos de oscilação do pêndulo.
  #+begin_src fortran :exports code
      do i = 1, n
        
         t = t + dt
         
         tmp_omg = omg - sin(tt)*dt-gamma*omg*dt
         tmp_tt = tt + tmp_omg*dt 

         tmp_omg1 = omg1 - sin(tt1)*dt-gamma*omg1*dt+f01*sin(OM*t)*dt
         tmp_tt1 = tt1 + tmp_omg1*dt

         tmp_omg2 = omg2 - sin(tt2)*dt-gamma*omg2*dt+f02*sin(OM*t)*dt
         tmp_tt2 = tt2 + tmp_omg2*dt

         write(10,*) t, mod(tmp_tt+100*pi,-2*pi), 
     +        mod(tmp_tt1+100*pi,-2*pi), mod(tmp_tt2+100*pi,-2*pi)

         write(11, *) t, tmp_omg, tmp_omg1, tmp_omg2

         if(tmp_tt * tt < 0) then
            count = count + 1
         end if
         if(tmp_tt2 * tt1 < 0) then
            count1 = count1+ 1
         end if
         if(tmp_tt2 * tt2 < 0) then
            count2 = count2 + 1
         end if
         
         omg = tmp_omg
         tt = tmp_tt

         omg1 = tmp_omg1
         tt1 = tmp_tt1

         omg2 = tmp_omg2
         tt2 = tmp_tt2

      end do

      T = (2*t)/count
      T1 = (2*t)/count1
      T2 = (2*t)/count2

      write(*, *) T, T1, T2
  #+end_src

  Os valores iniciais das variáveis presentes no código acima são semelhentes às do [[codigoGamma]],
  além deles as variáveis =count=, =count1= e =count2= usadas para o cálculo do período são inicializadas
  em zero.


   #+attr_latex: :width 18cm :height 10cm :placement [!h]
  [[./tarefa-b/b4/tarefa-b4-grafico.pdf]]
  
  A aproximação numérica para a frequência do caso onde \( F_0 = 0 \) nós dá \( f =
  6.4516129032256053 \), esse é o caso
  do pêndulo com apenas forças dissipativas presentes (sistema analisado no *B3*), portanto, sabemos
  que a frequência tende a ser nula, já que o sistema é amortecido até não haver mais oscilação.

  Para o caso de \( F_0 = \frac{1}{2} \) as oscilações forçadas tem energia mantida a mesma durante
  toda evolução do sistema, por isso o comportamento do gráfico é o de um pêndulo simples, como
  estudado nas seções anteriores.

  Já para \( F_0 = \frac{6}{5} \) o sistema tem comportamento caótico. Uma forma de mostrar que o
  sistema pode ser caótico para um \( F_0 \) podemos analisar o comportamento do sistema para
  difentes valores iniciais de \( \theta  \), isto é, mostrar que o sistema é sensível a valores
  iniciais e que valores minimamente diferentes podem fazer com que o sistema evolua de formas
  muito diferentes. O gráfico ([[graficob4]]) ilustra bem esse fenômeno.


  #+name: graficob4
  #+caption: Gráfico de \( \theta \times t \) para diferentes \( \theta_s  \) com \( \gamma = \frac{1}{2}, \Omega = \frac{2}{3}  \)  e \( F_0 = \frac{6}{5} \) .
  #+attr_latex: :width 10cm :height 8cm :placement [!h]
  [[./tarefa-b/b4/tarefa-b4-grafico-thetas.pdf]]




  Por causa desse comportamento do gráfico não é possível cálcular a frequência já que o sistema não
  é periódioco durante toda sua evolução temporal.

  #+latex:\clearpage

