projeto4/relatorio4.html
<div id="outline-container-orgf2c32fb" class="outline-4">
<h4 id="orgf2c32fb">Código em Fortran</h4>
<div class="outline-text-4" id="text-orgf2c32fb">
<p>
O código para realizar essa simulação é apenas uma alteração do método de Euler-Cromer
com adição dos novos valores utilizados.
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>Rotina que realiza o cálculo com \( \gamma = \frac{1}{2} \)</label><pre class="src src-fortran" id="orga352cb3">  tt = 7 * pi / 18 
   <span style="color: #3a81c3; font-weight: bold;">do</span> i = 1, n

   t = t + dt

   tmp_omg = omg - <span style="color: #3a81c3;">sin</span><span style="color: #3a81c3;">(</span>tt<span style="color: #3a81c3;">)</span> * dt - gamma*omg*dt
   tmp_tt = tt + tmp_omg * dt

   omg = tmp_omg
   tt = tmp_tt
   <span style="color: #3a81c3; font-weight: bold;">write</span><span style="color: #3a81c3;">(</span>10, *<span style="color: #3a81c3;">)</span> t, tmp_tt
<span style="color: #3a81c3; font-weight: bold;">end</span> <span style="color: #3a81c3; font-weight: bold;">do</span>
</pre>
</div>

<p>
A partir dos resultados desse programa foi gerado o gráfico (<a href="#org0683711">3</a>) , que constata o que
esperavamos, que o comportamento das oscilações para o \( \gamma  \) escolhido é subcritíco. 
</p>

<p>
<a href="./tarefa-b/b3/tarefa-b3-grafico-oscilacoes.pdf">./tarefa-b/b3/tarefa-b3-grafico-oscilacoes.pdf</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgaa248c3" class="outline-3">
<h3 id="orgaa248c3"><b>B4</b></h3>
<div class="outline-text-3" id="text-orgaa248c3">
<p>
Dando continuidade à tarefa anterior, nesse tópico foi o objetivo é fazer simulações
para o sistema com dissipações e com oscilações forçadas por forças de intensidades diferentes.
Para o sistema no caso onde \( \gamma  = \frac{1}{2} \), \( \Omega = \frac{3}{2} \) com \(
\Delta t = 0.03 \) para \( F_0 = 0, F_0 = \frac{1}{2} \text{ e } F_0 = \frac{6}{5} \) foi usada a
equação (\ref{eq:formulaGeralPendulo}) para criar os gráficos conjuntos de para o \( \theta  \) e \( \omega \) em função do tempo.
</p>


<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span>Código do cálculo dos \( \theta  \) , \( \omega \) e períodos de oscilação do pêndulo.</label><pre class="src src-fortran"> <span style="color: #3a81c3; font-weight: bold;">do</span> i = 1, n

    t = t + dt

    tmp_omg = omg - <span style="color: #3a81c3;">sin</span><span style="color: #3a81c3;">(</span>tt<span style="color: #3a81c3;">)</span>*dt-gamma*omg*dt
    tmp_tt = tt + tmp_omg*dt 

    tmp_omg1 = omg1 - <span style="color: #3a81c3;">sin</span><span style="color: #3a81c3;">(</span>tt1<span style="color: #3a81c3;">)</span>*dt-gamma*omg1*dt+f01*<span style="color: #3a81c3;">sin</span><span style="color: #3a81c3;">(</span>OM*t<span style="color: #3a81c3;">)</span>*dt
    tmp_tt1 = tt1 + tmp_omg1*dt

    tmp_omg2 = omg2 - <span style="color: #3a81c3;">sin</span><span style="color: #3a81c3;">(</span>tt2<span style="color: #3a81c3;">)</span>*dt-gamma*omg2*dt+f02*<span style="color: #3a81c3;">sin</span><span style="color: #3a81c3;">(</span>OM*t<span style="color: #3a81c3;">)</span>*dt
    tmp_tt2 = tt2 + tmp_omg2*dt

    <span style="color: #3a81c3; font-weight: bold;">write</span><span style="color: #3a81c3;">(</span>10,*<span style="color: #3a81c3;">)</span> t, <span style="color: #3a81c3;">mod</span><span style="color: #3a81c3;">(</span>tmp_tt+100*pi,-2*pi<span style="color: #3a81c3;">)</span>, 
+        <span style="color: #3a81c3;">mod</span><span style="color: #3a81c3;">(</span>tmp_tt1+100*pi,-2*pi<span style="color: #3a81c3;">)</span>, <span style="color: #3a81c3;">mod</span><span style="color: #3a81c3;">(</span>tmp_tt2+100*pi,-2*pi<span style="color: #3a81c3;">)</span>

    <span style="color: #3a81c3; font-weight: bold;">write</span><span style="color: #3a81c3;">(</span>11, *<span style="color: #3a81c3;">)</span> t, tmp_omg, tmp_omg1, tmp_omg2

    <span style="color: #3a81c3; font-weight: bold;">if</span><span style="color: #3a81c3;">(</span>tmp_tt * tt &lt; 0<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3; font-weight: bold;">then</span>
       count = count + 1
    <span style="color: #3a81c3; font-weight: bold;">end</span> <span style="color: #3a81c3; font-weight: bold;">if</span>
    <span style="color: #3a81c3; font-weight: bold;">if</span><span style="color: #3a81c3;">(</span>tmp_tt2 * tt1 &lt; 0<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3; font-weight: bold;">then</span>
       count1 = count1+ 1
    <span style="color: #3a81c3; font-weight: bold;">end</span> <span style="color: #3a81c3; font-weight: bold;">if</span>
    <span style="color: #3a81c3; font-weight: bold;">if</span><span style="color: #3a81c3;">(</span>tmp_tt2 * tt2 &lt; 0<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3; font-weight: bold;">then</span>
       count2 = count2 + 1
    <span style="color: #3a81c3; font-weight: bold;">end</span> <span style="color: #3a81c3; font-weight: bold;">if</span>

    omg = tmp_omg
    tt = tmp_tt

    omg1 = tmp_omg1
    tt1 = tmp_tt1

    omg2 = tmp_omg2
    tt2 = tmp_tt2

 <span style="color: #3a81c3; font-weight: bold;">end</span> <span style="color: #3a81c3; font-weight: bold;">do</span>

 T = <span style="color: #3a81c3;">(</span>2*t<span style="color: #3a81c3;">)</span>/count
 T1 = <span style="color: #3a81c3;">(</span>2*t<span style="color: #3a81c3;">)</span>/count1
 T2 = <span style="color: #3a81c3;">(</span>2*t<span style="color: #3a81c3;">)</span>/count2

 <span style="color: #3a81c3; font-weight: bold;">write</span><span style="color: #3a81c3;">(</span>*, *<span style="color: #3a81c3;">)</span> T, T1, T2
</pre>
</div>

<p>
Os valores iniciais das variáveis presentes no código acima são semelhentes às do <a href="#orga352cb3">6</a>,
além deles as variáveis <code>count</code>, <code>count1</code> e <code>count2</code> usadas para o cálculo do período são inicializadas
em zero.
</p>


<p>
<a href="./tarefa-b/b4/tarefa-b4-grafico.pdf">./tarefa-b/b4/tarefa-b4-grafico.pdf</a>
</p>

<p>
A aproximação numérica para a frequência do caso onde \( F_0 = 0 \) nós dá \( f =
  6.4516129032256053 \), esse é o caso
do pêndulo com apenas forças dissipativas presentes (sistema analisado no <b>B3</b>), portanto, sabemos
que a frequência tende a ser nula, já que o sistema é amortecido até não haver mais oscilação.
</p>

<p>
Para o caso de \( F_0 = \frac{1}{2} \) as oscilações forçadas tem energia mantida a mesma durante
toda evolução do sistema, por isso o comportamento do gráfico é o de um pêndulo simples, como
estudado nas seções anteriores.
</p>

<p>
Já para \( F_0 = \frac{6}{5} \) o sistema tem comportamento caótico. Uma forma de mostrar que o
sistema pode ser caótico para um \( F_0 \) podemos analisar o comportamento do sistema para
difentes valores iniciais de \( \theta  \), isto é, mostrar que o sistema é sensível a valores
iniciais e que valores minimamente diferentes podem fazer com que o sistema evolua de formas
muito diferentes. O gráfico (<a href="#orgd86cec3">4</a>) ilustra bem esse fenômeno.
</p>


<p>
<a href="./tarefa-b/b4/tarefa-b4-grafico-thetas.pdf">./tarefa-b/b4/tarefa-b4-grafico-thetas.pdf</a>
</p>




<p>
Por causa desse comportamento do gráfico não é possível cálcular a frequência já que o sistema não
é periódioco durante toda sua evolução temporal.
</p>
</div>
</div>
</div>
