projeto4/relatorio4.org
* Tarefa C

  Afim de analisar mais profundamente o emergência de caos podemos modelar o sistema com dois
  pêndulos, com \( \theta _0  \) iniciais próximos tal que \( \Delta \theta = 10^{-3} \), com o
  expoente de Liapunov conseguimos calcular a taxa de separação entre as trajetórias tomadas
  pelos dois pêndulos, dizemos que, para uma trajetória cujos \( \theta  \) se separam
  exponencialmente, o sistema é caótico. Abaixo está a expressão para o expoente de Liapunov

  #+begin_latex
  \begin{equation}
  \Delta \theta (t) \approx e^{\lambda t} = 
  \begin{cases}
   \lambda  < 0 \Rightarrow \text{ sistema não caótico },\\
   \lambda > 0 \Rightarrow \text{sistema caótico}   
\end{cases}
  \label{eq:liapunov}  
  \end{equation}
  #+end_latex

  como queremos estimaro  valor de \( \lambda  \), tomamos o logaritmo neperiano da relação e com
  isso obtemos uma relação linear, onde \( \lambda  \) é o coeficiente angular da reta

  #+begin_latex
  \begin{equation}
   \ln(|\Delta \theta (t)|) = \lambda t  
  \label{eq:liapunovFinal}
  \end{equation}
  #+end_latex

  As únicas alterações necessárias para realização dessa simulação em relação às anteriores são os
  valores de saída e a realização da subtração do ângulo dos dois pêndulos, as modificações estão
  no código abaixo:

  #+caption: Código para execução da simulação .
  #+begin_src fortran :exports code
    f = 0.5d0 ! 1.2d0 
    do i = 1, n

       t = t + dt

       tmp_omg1 = omg1 - sin(tt1)*dt-gamma*omg1*dt+f*sin(OM*t)*dt
       tmp_tt1 = tt1 + tmp_omg1*dt

       tmp_omg2 = omg2 - sin(tt2)*dt-gamma*omg2*dt+f*sin(OM*t)*dt
       tmp_tt2 = tt2 + tmp_omg2*dt

       write(10, *) t, log(abs(tt2 - tt1))

       omg1 = tmp_omg1
       tt1 = tmp_tt1

       omg2 = tmp_omg2
       tt2 = tmp_tt2

    end do
  #+end_src
  
  #+latex: \clearpage
  O experimento é realizado para um valor incial arbritário igual \( \theta = 7 \pi / 18 \), onde \(  \Delta \theta = 0.001 \) 
  e partir dos valores coletados foi possível construir os gráficos abaixo, que foram usados nas
  analises à cerca do *coeficiente de Liapunov* e o comportamento deterministico ou não do sistema.
  
  Fazendo o ajuste linear utilizando foi obtido os valores aproximados para \( \lambda  \),
  para o caso onde \( F_0 = 1/2 \) temos \( \lambda =  -0.254 \pm 0.001  \)
  e para \( F_0 = 6/5 \), \( \lambda = 0.131 \pm 0.001 \). O valor de \( \lambda  \) foi estimado
  usando o graficador =GNUPLOT=. 

  A partir desses valores cálculados para \( \lambda \) para ambas forças iniciais, podemos dizer
  que, para o caso onde \( F_0 = 6/5 \) o sistema possui comportamento caótico, pois seu \( \lambda
  > 0 \).
  Com isso temos uma comprovação para o resultado obtido anteriormente, quando foi tentei
  calcular o periódo de oscilação do sistema com essa mesma \( F_0 \).

  #+name: graficosC
  #+caption: Gráficos \( \Delta (\theta ) \times t \) em escala semi-logaritmíca, com \( F_0 = 1/2 \) e \( F_0 = 6/5 \), respectivamente. 
  #+attr_latex: :width 12cm :height 13cm :placement [!t]
  [[./tarefa-c/tarefa-c-grafico.pdf]]
 
  Além disso, fica claro pelo gráfico ([[graficosC]]) que o crescimento da constante de Liapunov é
  exponencial, ou seja, para o caso do sistema caótico as trajetórias se afastam também
  exponencialmente, então o comportamento do sistema não pode ser previsto.
  #+latex: \clearpage
* Tarefa D
  Continuando com o sistema 
  #+caption: Gráficos de \( \omega(\theta) \times \theta \) para \( F_0 = 1/2 \)  e \( F_0 = 6/5 \).
  #+caption: À esquerda gráficos para \( F_0 = 1/2 \) com \( \theta _0 = \pi/6, \pi/6 + 0.03, \pi/6 - 0.03 \), respectivamente.
  #+caption: Á direita gráficos com \( F_0 = 6/5 \) com \( \theta _0 = \pi/6, \pi/6 + 0.03, \pi/6 - 0.03 \), respectivamente.
  #+attr_latex: :width 15cm :height 19cm :placement [!h]
  [[./tarefa-d/tarefa-d-grafico.pdf]]
  #+latex: \clearpage 
* Tarefa E
#+latex: \clearpage
#+latex: \appendix
#+latex:\pagenumbering{roman}
#+latex:\appendix
* Demonstração da integral eliptíca

Sabemos que a energia do sistema do pêndulo é dada pela fórmula
\(  E = \frac{1}{2} m l^2 \dot{\theta}^2 - mgl \cos \theta  \) e a energia inicial do sistema é \( E = - mg l
\cos \theta _0  \), fazendo
\[ -mgl \cos \theta_0 = \frac{1}{2} m l^2 \dot{\theta}^2 - mgl \cos \theta     \]
multiplicando a equação por \( (1/m) \) temos
\[ -gl \cos \theta _0 = \frac{1}{2} l^2 \dot{\theta}^2 - gl \cos \theta     \]
como queremos chegar numa relação que nos permite escrever o período em função
do angulo \( \theta _0 \), então vamos isolar a derivada da equação, então

\[ gl (\cos \theta - \cos \theta _0) = \frac{1}{2} l^2 \dot{\theta}^2   \]
\[ \frac{2g}{l} \left( \cos \theta -\cos \theta _0    \right)  = \dot{\theta }^2\]

\[ \dot{\theta } = \sqrt{\frac{2g}{l}} \sqrt{\cos \theta - \cos \theta _0}  = \frac{d \theta }{dt} \]

\[ dt = \frac{d \theta }{  \sqrt{\frac{2g}{l}} \sqrt{\cos \theta - \cos \theta _0  }} = \sqrt{\frac{l}{2g}}
\frac{1}{\sqrt{\cos \theta - \cos \theta _0}} d \theta  \]

integrando ambos lados no intervalo \( [ 0, T/2] \), ou seja \( [- \theta _0, \theta _0] \) , temos


\[ \int_{0}^{T/2} dt = \sqrt{ \frac{l}{2g} } \int_{- \theta _0}^{\theta _0} \frac{1}{ \sqrt{\cos \theta - \cos \theta
_0}} d \theta    \]

\[ \frac{T}{2} = \sqrt{\frac{l}{2g}} \int_{- \theta _0}^{\theta _0} \frac{1}{ \sqrt{\cos \theta - \cos \theta
_0}} d \theta   \]

\[ T = 2 \sqrt{\frac{l}{2g}} \int_{- \theta _0}^{\theta _0} \frac{1}{ \sqrt{\cos \theta - \cos \theta
_0}} d \theta = \sqrt{\frac{4l}{2g}} \int_{- \theta _0}^{\theta _0} \frac{1}{ \sqrt{\cos \theta - \cos \theta
_0}} d \theta  \]

#+begin_latex
\begin{equation}
\boxed{ T(\theta _0) = \sqrt{\frac{2l}{g}} \int_{- \theta _0}^{\theta _0} \frac{1}{ \sqrt{\cos \theta - \cos \theta _0}} d \theta  }
\label{eq:integralEliptica}
\end{equation}
#+end_latex
















