projeto4/relatorio4.html

<div id="outline-container-org8e322c3" class="outline-2">
<h2 id="org8e322c3"><span class="section-number-2">3.</span> Tarefa C</h2>
<div class="outline-text-2" id="text-3">
<p>
Afim de analisar mais profundamente o emergência de caos podemos modelar o sistema com dois
pêndulos, com \( \theta _0  \) iniciais próximos tal que \( \Delta \theta = 10^{-3} \), com o
expoente de Liapunov conseguimos calcular a taxa de separação entre as trajetórias tomadas
pelos dois pêndulos, dizemos que, para uma trajetória cujos \( \theta  \) se separam
exponencialmente, o sistema é caótico. Abaixo está a expressão para o expoente de Liapunov
</p>

<div class="latex" id="org599792b">
  \begin{equation}
  \Delta \theta (t) \approx e^{\lambda t} = 
  \begin{cases}
   \lambda  < 0 \Rightarrow \text{ sistema não caótico },\\
   \lambda > 0 \Rightarrow \text{sistema caótico}   
\end{cases}
  \label{eq:liapunov}  
  \end{equation}

</div>

<p>
como queremos estimaro  valor de \( \lambda  \), tomamos o logaritmo neperiano da relação e com
isso obtemos uma relação linear, onde \( \lambda  \) é o coeficiente angular da reta
</p>

<div class="latex" id="orgaaa129d">
\begin{equation}
 \ln(|\Delta \theta (t)|) = \lambda t  
\label{eq:liapunovFinal}
\end{equation}

</div>

<p>
As únicas alterações necessárias para realização dessa simulação em relação às anteriores são os
valores de saída e a realização da subtração do ângulo dos dois pêndulos, as modificações estão
no código abaixo:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 8: </span>Código para execução da simulação .</label><pre class="src src-fortran">f = 0.5d0 <span style="color: #2aa1ae; background-color: #ecf3ec;">! </span><span style="color: #2aa1ae; background-color: #ecf3ec;">1.2d0 </span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">d</span><span style="color: #2aa1ae; background-color: #ecf3ec;">o i = 1, n</span>

   t = t + dt

   tmp_omg1 = omg1 - <span style="color: #3a81c3;">sin</span><span style="color: #3a81c3;">(</span>tt1<span style="color: #3a81c3;">)</span>*dt-gamma*omg1*dt+f*<span style="color: #3a81c3;">sin</span><span style="color: #3a81c3;">(</span>OM*t<span style="color: #3a81c3;">)</span>*dt
   tmp_tt1 = tt1 + tmp_omg1*dt

   tmp_omg2 = omg2 - <span style="color: #3a81c3;">sin</span><span style="color: #3a81c3;">(</span>tt2<span style="color: #3a81c3;">)</span>*dt-gamma*omg2*dt+f*<span style="color: #3a81c3;">sin</span><span style="color: #3a81c3;">(</span>OM*t<span style="color: #3a81c3;">)</span>*dt
   tmp_tt2 = tt2 + tmp_omg2*dt

   <span style="color: #3a81c3; font-weight: bold;">write</span><span style="color: #3a81c3;">(</span>10, *<span style="color: #3a81c3;">)</span> t, <span style="color: #3a81c3;">log</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">abs</span><span style="color: #6c3163;">(</span>tt2 - tt1<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

   omg1 = tmp_omg1
   tt1 = tmp_tt1

   omg2 = tmp_omg2
   tt2 = tmp_tt2

<span style="color: #3a81c3; font-weight: bold;">end</span> <span style="color: #3a81c3; font-weight: bold;">do</span>
</pre>
</div>

<p>
O experimento é realizado para um valor incial arbritário igual \( \theta = 7 \pi / 18 \), onde \(  \Delta \theta = 0.001 \) 
e partir dos valores coletados foi possível construir os gráficos abaixo, que foram usados nas
analises à cerca do <b>coeficiente de Liapunov</b> e o comportamento deterministico ou não do sistema.
</p>

<p>
Fazendo o ajuste linear utilizando foi obtido os valores aproximados para \( \lambda  \),
para o caso onde \( F_0 = 1/2 \) temos \( \lambda =  -0.254 \pm 0.001  \)
e para \( F_0 = 6/5 \), \( \lambda = 0.131 \pm 0.001 \). O valor de \( \lambda  \) foi estimado
usando o graficador <code>GNUPLOT</code>. 
</p>

<p>
A partir desses valores cálculados para \( \lambda \) para ambas forças iniciais, podemos dizer
que, para o caso onde \( F_0 = 6/5 \) o sistema possui comportamento caótico, pois seu \( \lambda
  > 0 \).
Com isso temos uma comprovação para o resultado obtido anteriormente, quando foi tentei
calcular o periódo de oscilação do sistema com essa mesma \( F_0 \).
</p>

<p>
<a href="./tarefa-c/tarefa-c-grafico.pdf">./tarefa-c/tarefa-c-grafico.pdf</a>
</p>

<p>
Além disso, fica claro pelo gráfico (<a href="#orgefb3d36">5</a>) que o crescimento da constante de Liapunov é
exponencial, ou seja, para o caso do sistema caótico as trajetórias se afastam também
exponencialmente, então o comportamento do sistema não pode ser previsto.
</p>
</div>
</div>
<div id="outline-container-org5a2c910" class="outline-2">
<h2 id="org5a2c910"><span class="section-number-2">4.</span> Tarefa D</h2>
<div class="outline-text-2" id="text-4">
<p>
Continuando com o sistema 
</p>
<p>
<a href="./tarefa-d/tarefa-d-grafico.pdf">./tarefa-d/tarefa-d-grafico.pdf</a>
</p>
</div>
</div>
<div id="outline-container-org054ba1a" class="outline-2">
<h2 id="org054ba1a"><span class="section-number-2">5.</span> Tarefa E</h2>
<div class="outline-text-2" id="text-5">
</div>
</div>
<div id="outline-container-org3ce5bea" class="outline-2">
<h2 id="org3ce5bea"><span class="section-number-2">6.</span> Demonstração da integral eliptíca</h2>
<div class="outline-text-2" id="text-6">
<p>
Sabemos que a energia do sistema do pêndulo é dada pela fórmula
\(  E = \frac{1}{2} m l^2 \dot{\theta}^2 - mgl \cos \theta  \) e a energia inicial do sistema é \( E = - mg l
\cos \theta _0  \), fazendo
\[ -mgl \cos \theta_0 = \frac{1}{2} m l^2 \dot{\theta}^2 - mgl \cos \theta     \]
multiplicando a equação por \( (1/m) \) temos
\[ -gl \cos \theta _0 = \frac{1}{2} l^2 \dot{\theta}^2 - gl \cos \theta     \]
como queremos chegar numa relação que nos permite escrever o período em função
do angulo \( \theta _0 \), então vamos isolar a derivada da equação, então
</p>

<p>
\[ gl (\cos \theta - \cos \theta _0) = \frac{1}{2} l^2 \dot{\theta}^2   \]
\[ \frac{2g}{l} \left( \cos \theta -\cos \theta _0    \right)  = \dot{\theta }^2\]
</p>

<p>
\[ \dot{\theta } = \sqrt{\frac{2g}{l}} \sqrt{\cos \theta - \cos \theta _0}  = \frac{d \theta }{dt} \]
</p>

<p>
\[ dt = \frac{d \theta }{  \sqrt{\frac{2g}{l}} \sqrt{\cos \theta - \cos \theta _0  }} = \sqrt{\frac{l}{2g}}
\frac{1}{\sqrt{\cos \theta - \cos \theta _0}} d \theta  \]
</p>

<p>
integrando ambos lados no intervalo \( [ 0, T/2] \), ou seja \( [- \theta _0, \theta _0] \) , temos
</p>


<p>
\[ \int_{0}^{T/2} dt = \sqrt{ \frac{l}{2g} } \int_{- \theta _0}^{\theta _0} \frac{1}{ \sqrt{\cos \theta - \cos \theta
_0}} d \theta    \]
</p>

<p>
\[ \frac{T}{2} = \sqrt{\frac{l}{2g}} \int_{- \theta _0}^{\theta _0} \frac{1}{ \sqrt{\cos \theta - \cos \theta
_0}} d \theta   \]
</p>

<p>
\[ T = 2 \sqrt{\frac{l}{2g}} \int_{- \theta _0}^{\theta _0} \frac{1}{ \sqrt{\cos \theta - \cos \theta
_0}} d \theta = \sqrt{\frac{4l}{2g}} \int_{- \theta _0}^{\theta _0} \frac{1}{ \sqrt{\cos \theta - \cos \theta
_0}} d \theta  \]
</p>

<div class="latex" id="org7d9d540">
\begin{equation}
\boxed{ T(\theta _0) = \sqrt{\frac{2l}{g}} \int_{- \theta _0}^{\theta _0} \frac{1}{ \sqrt{\cos \theta - \cos \theta _0}} d \theta  }
\label{eq:integralEliptica}
\end{equation}

</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 12 de novembro de 2022</p>
<p class="author">Author: <b>\Lage{Jefter Santiago Mares}</b>  n\(^{\circ}\) USP:12559016</p>
<p class="date">Created: 2022-12-02 Fri 11:48</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
